Revit 2027 API
TextNote.TextNoteType Property
Access the type of the TextNote object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public TextNoteType TextNoteType { get; set; }
Public Property TextNoteType As TextNoteType
	Get
	Set
public:
property TextNoteType^ TextNoteType {
	TextNoteType^ get ();
	void set (TextNoteType^ value);
}
member TextNoteType : TextNoteType with get, set
Property Value
TextNoteType
Remarks
The type of the TextNote object can be retrieved or changed.
See Also
Reference
TextNote Class
Autodesk.Revit.DB Namespace